AzureActivity
| where TimeGenerated > ago(7d)
| where ResourceProvider == "Microsoft.Compute" and OperationName == "Delete Virtual Machine"
| where HTTPRequest contains "DELETE"
| extend EventSubmissionTimestampHKT = EventSubmissionTimestamp + 8h
| project VM_Name = Resource, Deleted_On = format_datetime(EventSubmissionTimestampHKT, 'dd-MM-yyyy-HHtt'), Created_By = Caller
| distinct Deleted_On , VM_Name , Created_By
| sort by Deleted_On desc